<?php

namespace App\Http\Controllers;

use Illuminate\Http\Request;
use Illuminate\Support\Facades\Input;

class APIController extends Controller
{
  public function numbers($number)
  {
    $response = digit_text($number, 'ru');
    return response()->json([
        'data' => $response
    ], 200);
  }

  public function maths()
  {
    $a = Input::get('a');
    $b = Input::get('b');
    $c = Input::get('c');

    if ($a == 0) {
      return response()->json([
          'data' => 'Не квадратное уравнение'
      ], 200);
    } else {
      $d = $b * $b - 4 * $a * $c;

      if ($d < 0) {
        return response()->json([
            'data' => 'Нет корней'
        ], 200);
      } else {
        $d = sqrt($d);
        $x1 = ((-$b) + $d) / (2 * $a);
        $x2 = ((-$b) - $d) / (2 * $a);
        return response()->json([
            'data' => ['x1' => $x1, 'x2' => $x2]
        ], 200);
      }
    }

  }

  public function days()
  {
    $days = ['Воскресенье', 'Понедельник', 'Вторник', 'Среда','Четверг', 'Пятница', 'Суббота'];
    $date = Input::get('date');
    return response()->json([
        'data' => $days[date("w", strtotime($date))]
    ], 200);
  }

  public function equations($index)
  {
    $x = 1;
    $y = 0;
    for ($i = 0; $i < $index; $i++) {
      $x += $y;
      $y = $x - $y;
    }
    return response()->json([
        'data' => $y
    ], 200);
  }

  public function regions($number)
  {
    $codes = [];
    $codes[1] = 'Республика Адыгея';
    $codes[2] = 'Республика Башкортостан';
    $codes[3] = 'Республика Бурятия';
    $codes[4] = 'Республика Алтай';
    $codes[5] = 'Республика Дагестан';
    $codes[6] = 'Республика Ингушетия';
    $codes[7] = 'Кабардино-Балкарская Республика';
    $codes[8] = 'Республика Калмыкия';
    $codes[9] = 'Карачаево-Черкесская Республика';
    $codes[10] = 'Республика Карелия';
    $codes[11] = 'Республика Коми';
    $codes[12] = 'Республика Марий Эл';
    $codes[13] = 'Республика Мордовия';
    $codes[14] = 'Республика Саха (Якутия)';
    $codes[15] = 'Республика Северная Осетия - Алания';
    $codes[16] = 'Республика Татарстан';
    $codes[17] = 'Республика Тыва';
    $codes[18] = 'Удмуртская Республика';
    $codes[19] = 'Республика Хакасия';
    $codes[20] = 'Чеченская республика';
    $codes[21] = 'Чувашская Республика';
    $codes[22] = 'Алтайский край';
    $codes[23] = 'Краснодарский край';
    $codes[24] = 'Красноярский край';
    $codes[25] = 'Приморский край';
    $codes[26] = 'Ставропольский край';
    $codes[27] = 'Хабаровский край';
    $codes[28] = 'Амурская область';
    $codes[29] = 'Архангельская область';
    $codes[30] = 'Астраханская область';
    $codes[31] = 'Белгородская область';
    $codes[32] = 'Брянская область';
    $codes[33] = 'Владимирская область';
    $codes[34] = 'Волгоградская область';
    $codes[35] = 'Вологодская область';
    $codes[36] = 'Воронежская область';
    $codes[37] = 'Ивановская область';
    $codes[38] = 'Иркутская область';
    $codes[39] = 'Калининградская область';
    $codes[40] = 'Калужская область';
    $codes[41] = 'Камчатский край';
    $codes[42] = 'Кемеровская область';
    $codes[43] = 'Кировская область';
    $codes[44] = 'Костромская область';
    $codes[45] = 'Курганская область';
    $codes[46] = 'Курская область';
    $codes[47] = 'Ленинградская область';
    $codes[48] = 'Липецкая область';
    $codes[49] = 'Магаданская область';
    $codes[50] = 'Московская область';
    $codes[51] = 'Мурманская область';
    $codes[52] = 'Нижегородская область';
    $codes[53] = 'Новгородская область';
    $codes[54] = 'Новосибирская область';
    $codes[55] = 'Омская область';
    $codes[56] = 'Оренбургская область';
    $codes[57] = 'Орловская область';
    $codes[58] = 'Пензенская область';
    $codes[59] = 'Пермский край';
    $codes[60] = 'Псковская область';
    $codes[61] = 'Ростовская область';
    $codes[62] = 'Рязанская область';
    $codes[63] = 'Самарская область';
    $codes[64] = 'Саратовская область';
    $codes[65] = 'Сахалинская область';
    $codes[66] = 'Свердловская область';
    $codes[67] = 'Смоленская область';
    $codes[68] = 'Тамбовская область';
    $codes[69] = 'Тверская область';
    $codes[70] = 'Томская область';
    $codes[71] = 'Тульская область';
    $codes[72] = 'Тюменская область';
    $codes[73] = 'Ульяновская область';
    $codes[74] = 'Челябинская область';
    $codes[75] = 'Забайкальский край';
    $codes[76] = 'Ярославская область';
    $codes[77] = 'Москва';
    $codes[78] = 'Санкт-Петербург';
    $codes[79] = 'Еврейская автономная область';
    $codes[80] = 'Забайкальский край';
    $codes[81] = 'Пермский край';
    $codes[82] = 'Республика Крым';
    $codes[83] = 'Ненецкий автономный округ';
    $codes[84] = 'Красноярский край';
    $codes[85] = 'Иркутская область';
    $codes[86] = 'Ханты-Мансийский АО';
    $codes[87] = 'Чукотский автономный округ';
    $codes[88] = 'Красноярский край';
    $codes[89] = 'Ямало-Ненецкий автономный округ';
    $codes[90] = 'Московская область';
    $codes[91] = 'Калининградская область';
    $codes[92] = 'Севастополь';
    $codes[93] = 'Краснодарский край';
    $codes[94] = 'Байконур';
    $codes[95] = 'Чеченская республика';
    $codes[96] = 'Свердловская область';
    $codes[97] = 'Москва';
    $codes[98] = 'Санкт-Петербург';
    $codes[99] = 'Москва';
    $codes[101] = 'Республика Адыгея';
    $codes[102] = 'Республика Башкортостан';
    $codes[103] = 'Республика Бурятия';
    $codes[109] = 'Карачаево-Черкесская Республика';
    $codes[111] = 'Республика Коми';
    $codes[113] = 'Республика Мордовия';
    $codes[116] = 'Республика Татарстан';
    $codes[118] = 'Удмуртская Республика';
    $codes[121] = 'Чувашская Республика';
    $codes[123] = 'Краснодарский край';
    $codes[124] = 'Красноярский край';
    $codes[125] = 'Приморский край';
    $codes[126] = 'Ставропольский край';
    $codes[134] = 'Волгоградская область';
    $codes[136] = 'Воронежская область';
    $codes[138] = 'Иркутская область';
    $codes[142] = 'Кемеровская область';
    $codes[150] = 'Московская область ';
    $codes[152] = 'Нижегородская область';
    $codes[154] = 'Новосибирская область';
    $codes[159] = 'Пермский край';
    $codes[161] = 'Ростовская область';
    $codes[163] = 'Самарская область';
    $codes[164] = 'Саратовская область';
    $codes[173] = 'Ульяновская область';
    $codes[174] = 'Челябинская область';
    $codes[176] = 'Ярославская область';
    $codes[177] = 'Москва';
    $codes[178] = 'Санкт-Петербург';
    $codes[186] = 'Ханты-Мансийский АО';
    $codes[190] = 'Московская область';
    $codes[196] = 'Свердловская область';
    $codes[197] = 'Москва';
    $codes[199] = 'Москва';
    $codes[716] = 'Республика Татарстан';
    $codes[750] = 'Московская область';
    $codes[763] = 'Самарская область';
    $codes[777] = 'Москва';
    $codes[799] = 'Москва';

    $response = array_key_exists($number, $codes) ? $codes[$number] : 'Неверный номер региона';

    return response()->json([
        'data' => $response
    ], 200);
  }
}
